---
kind: other
id: AllMembers.T:Autodesk.Revit.DB.DetailCurveArray
source: html/a249d24b-b9a8-9806-11ac-f460e97005ca.htm
---
# DetailCurveArray Members

Initializes a new instance of the DetailCurveArray class